diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктовВФоне/ВКМ_МассовоеСозданиеАктовВФоне.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктовВФоне</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктовВФоне/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Создать(Команда)
	
	ИдЗадания = "";
	Индикатор = 0;
	СтрокаСостояния = "";
	
	Если ПроверитьЗаполнение() Тогда
		
		ПараметрыЗапуска = Новый Структура;
		ПараметрыЗапуска.Вставить("НачалоПериода", НачалоМесяца(Объект.Период));
		ПараметрыЗапуска.Вставить("Конецпериода", КонецМесяца(Объект.Период));
		ПараметрыЗапуска.Вставить("ДатаДоговора", НачалоМесяца(Объект.Период));
		
		СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
		Интервал = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
		ИдЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.Интервал = 2;
				
		ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, 
													Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект),
													ПараметрыОжидания);
													
						
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Массовое Создание Актов";

	ВыполняемыйМетод = "Обработки.ВКМ_МассовоеСозданиеАктовВФоне.ЗаполнитьНаСервере";
	
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
		
КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		ЭтаФорма.СтрокаСостояния = "Ошибка";
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		ЭтаФорма.Индикатор = 100;
		ЭтаФорма.СтрокаСостояния = "Выполнено";
		МассивДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ЗаполнитьСозданныеДокументы(МассивДокументов);
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура  ЗаполнитьСозданныеДокументы(МассивДокументов);
	
	Объект.СозданныеДокументы.Очистить();
	
	Если МассивДокументов.Количество() = 0 Тогда
		
		СтрокаСостояния = СтрШаблон("Нет оснований для создания документов");
		
	КонецЕсли;
		
	Для Каждого Документ Из МассивДокументов Цикл
		
		НоваяСтрока = Объект.СозданныеДокументы.Добавить();
		
		Если Документ.Реализация = Неопределено Тогда
			
			НоваяСтрока.Договор = Документ.Договор;
			СтрокаСостояния = СтрШаблон("По договорам %1 услуг не предоставлялось", Документ.Договор);
					
		Иначе 
			
			НоваяСтрока.Договор = Документ.Договор;       
			НоваяСтрока.Реализация = Документ.Реализация;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьНаСервере()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ОтменитьНаСервере();
КонецПроцедуры
